## Exploring the Northwind Traders database

In [2]:
%%sql
SELECT table_name AS name, table_type AS type
  FROM information_schema.tables
 WHERE table_schema = 'public' AND table_type IN ('BASE TABLE', 'VIEW');

 * postgresql://postgres:***@localhost:5432/northwind
14 rows affected.

[('territories', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE')]

In [4]:
%%sql
SELECT *
  FROM customers
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

In [5]:
%%sql
SELECT *
  FROM order_details
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 11, 14.0, 12, 0.0),
 (10248, 42, 9.8, 10, 0.0),
 (10248, 72, 34.8, 5, 0.0),
 (10249, 14, 18.6, 9, 0.0),
 (10249, 51, 42.4, 40, 0.0)]

In [6]:
%%sql
SELECT *
  FROM orders
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium')]

In [8]:
%%sql
SELECT *
  FROM products
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39, 0, 10, 1),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0, 13, 70, 25, 0),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0, 53, 0, 0, 0),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0, 0, 0, 1)]

## Combine orders and customers tables to get more detailed information about each order.

In [3]:
%%sql
CREATE VIEW customers_orders AS
SELECT o.order_id, o.employee_id, o.order_date,
       c.customer_id, c.company_name,  c.country
  FROM orders AS o
  JOIN customers AS c
    ON o.customer_id = c.customer_id;

 * postgresql://postgres:***@localhost:5432/northwind
Done.

[]

In [6]:
%%sql
SELECT *
  FROM customers_orders 
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 5, datetime.date(1996, 7, 4), 'VINET', 'Vins et alcools Chevalier', 'France'),
 (10249, 6, datetime.date(1996, 7, 5), 'TOMSP', 'Toms Spezialitäten', 'Germany'),
 (10250, 4, datetime.date(1996, 7, 8), 'HANAR', 'Hanari Carnes', 'Brazil'),
 (10251, 3, datetime.date(1996, 7, 8), 'VICTE', 'Victuailles en stock', 'France'),
 (10252, 4, datetime.date(1996, 7, 9), 'SUPRD', 'Suprêmes délices', 'Belgium')]

## Combine employees and orders tables to see who is responsible for each order.

In [7]:
%%sql
CREATE VIEW employees_orders AS
SELECT o.order_id, o.customer_id, o.order_date, 
       e.employee_id, e.last_name, e.first_name, e.title
  FROM orders AS o
  JOIN employees AS e
    ON o.employee_id = e.employee_id;

 * postgresql://postgres:***@localhost:5432/northwind
Done.

[]

In [8]:
%%sql
SELECT *
  FROM employees_orders
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 'VINET', datetime.date(1996, 7, 4), 5, 'Buchanan', 'Steven', 'Sales Manager'),
 (10249, 'TOMSP', datetime.date(1996, 7, 5), 6, 'Suyama', 'Michael', 'Sales Representative'),
 (10250, 'HANAR', datetime.date(1996, 7, 8), 4, 'Peacock', 'Margaret', 'Sales Representative'),
 (10251, 'VICTE', datetime.date(1996, 7, 8), 3, 'Leverling', 'Janet', 'Sales Representative'),
 (10252, 'SUPRD', datetime.date(1996, 7, 9), 4, 'Peacock', 'Margaret', 'Sales Representative')]

## Combine order_details, products, and orders tables to get detailed order information.

In [9]:
%%sql
CREATE VIEW order_product_details AS
SELECT o.order_id, o.customer_id, o.employee_id, o.order_date, 
       od.unit_price, od.quantity, od.discount,
       p.product_id, p.product_name
  FROM orders AS o
  JOIN order_details AS od
    ON o.order_id = od.order_id
  JOIN products AS p
    ON od.product_id = p.product_id;

 * postgresql://postgres:***@localhost:5432/northwind
Done.

[]

In [10]:
%%sql
SELECT *
  FROM order_product_details
 LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), 14.0, 12, 0.0, 11, 'Queso Cabrales'),
 (10248, 'VINET', 5, datetime.date(1996, 7, 4), 9.8, 10, 0.0, 42, 'Singaporean Hokkien Fried Mee'),
 (10248, 'VINET', 5, datetime.date(1996, 7, 4), 34.8, 5, 0.0, 72, 'Mozzarella di Giovanni'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), 18.6, 9, 0.0, 14, 'Tofu'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), 42.4, 40, 0.0, 51, 'Manjimup Dried Apples')]

## Employees sales rankings

In [19]:
%%sql
WITH employees_sales AS(
     SELECT opd.employee_id,
            e.last_name, e.first_name, e.title,
            ROUND(SUM(opd.unit_price*opd.quantity*(1-opd.discount))::numeric,2) AS total_sales
       FROM order_product_details AS opd
       JOIN employees AS e
         ON opd.employee_id = e.employee_id
      GROUP BY opd.employee_id, e.last_name, e.first_name, e.title);

SELECT employee_id, last_name, first_name, title, total_sales,
       RANK() OVER(ORDER BY total_sales DESC)
  FROM employees_sales;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(4, 'Peacock', 'Margaret', 'Sales Representative', Decimal('232890.85'), 1),
 (3, 'Leverling', 'Janet', 'Sales Representative', Decimal('202812.84'), 2),
 (1, 'Davolio', 'Nancy', 'Sales Representative', Decimal('192107.60'), 3),
 (2, 'Fuller', 'Andrew', 'Vice President, Sales', Decimal('166537.76'), 4),
 (8, 'Callahan', 'Laura', 'Inside Sales Coordinator', Decimal('126862.28'), 5),
 (7, 'King', 'Robert', 'Sales Representative', Decimal('124568.23'), 6),
 (9, 'Dodsworth', 'Anne', 'Sales Representative', Decimal('77308.07'), 7),
 (6, 'Suyama', 'Michael', 'Sales Representative', Decimal('73913.13'), 8),
 (5, 'Buchanan', 'Steven', 'Sales Manager', Decimal('68792.28'), 9)]

## Running total of monthly sales

In [11]:
%%sql
SELECT DATE_TRUNC('month', order_date)::DATE AS month,
       ROUND(SUM(unit_price*quantity*(1-discount))::numeric,2) AS month_sales,
       ROUND(SUM(SUM(unit_price*quantity*(1-discount))) 
       OVER(ORDER BY DATE_TRUNC('month', order_date) ASC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW)::numeric,2) AS running_total
  FROM order_product_details
 GROUP BY DATE_TRUNC('month', order_date);

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.date(1996, 7, 1), Decimal('27861.90'), Decimal('27861.90')),
 (datetime.date(1996, 8, 1), Decimal('25485.28'), Decimal('53347.17')),
 (datetime.date(1996, 9, 1), Decimal('26381.40'), Decimal('79728.57')),
 (datetime.date(1996, 10, 1), Decimal('37515.72'), Decimal('117244.30')),
 (datetime.date(1996, 11, 1), Decimal('45600.05'), Decimal('162844.34')),
 (datetime.date(1996, 12, 1), Decimal('45239.63'), Decimal('208083.97')),
 (datetime.date(1997, 1, 1), Decimal('61258.07'), Decimal('269342.04')),
 (datetime.date(1997, 2, 1), Decimal('38483.63'), Decimal('307825.68')),
 (datetime.date(1997, 3, 1), Decimal('38547.22'), Decimal('346372.90')),
 (datetime.date(1997, 4, 1), Decimal('53032.95'), Decimal('399405.85')),
 (datetime.date(1997, 5, 1), Decimal('53781.29'), Decimal('453187.14')),
 (datetime.date(1997, 6, 1), Decimal('36362.80'), Decimal('489549.94')),
 (datetime.date(1997, 7, 1), Decimal('51020.86'), Decimal('540570.80')),
 (datetime.date(1997, 8, 1), Decimal('47287.67'), Decimal('587858.47')),
 (datetime.date(1997, 9, 1), Decimal('55629.24'), Decimal('643487.71')),
 (datetime.date(1997, 10, 1), Decimal('66749.23'), Decimal('710236.94')),
 (datetime.date(1997, 11, 1), Decimal('43533.81'), Decimal('753770.74')),
 (datetime.date(1997, 12, 1), Decimal('71398.43'), Decimal('825169.17')),
 (datetime.date(1998, 1, 1), Decimal('94222.11'), Decimal('919391.28')),
 (datetime.date(1998, 2, 1), Decimal('99415.29'), Decimal('1018806.57')),
 (datetime.date(1998, 3, 1), Decimal('104854.16'), Decimal('1123660.73')),
 (datetime.date(1998, 4, 1), Decimal('123798.68'), Decimal('1247459.41')),
 (datetime.date(1998, 5, 1), Decimal('18333.63'), Decimal('1265793.04'))]

## Month over month sales growth

In [13]:
%%sql
WITH monthly_sales AS(
SELECT DATE_TRUNC('month', order_date)::DATE AS month,
       ROUND(SUM(unit_price*quantity*(1-discount))::numeric,2) AS month_sales,
       LAG(ROUND(SUM(unit_price*quantity*(1-discount))::numeric,2),1) OVER (ORDER BY DATE_TRUNC('month', order_date)) AS prev_month_sales 
  FROM order_product_details
 GROUP BY DATE_TRUNC('month', order_date)
)
SELECT *,
       ROUND(((month_sales - prev_month_sales) / prev_month_sales)*100.0,2)  AS MoM_perc_change
  FROM monthly_sales;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.date(1996, 7, 1), Decimal('27861.90'), None, None),
 (datetime.date(1996, 8, 1), Decimal('25485.28'), Decimal('27861.90'), Decimal('-8.53')),
 (datetime.date(1996, 9, 1), Decimal('26381.40'), Decimal('25485.28'), Decimal('3.52')),
 (datetime.date(1996, 10, 1), Decimal('37515.72'), Decimal('26381.40'), Decimal('42.21')),
 (datetime.date(1996, 11, 1), Decimal('45600.05'), Decimal('37515.72'), Decimal('21.55')),
 (datetime.date(1996, 12, 1), Decimal('45239.63'), Decimal('45600.05'), Decimal('-0.79')),
 (datetime.date(1997, 1, 1), Decimal('61258.07'), Decimal('45239.63'), Decimal('35.41')),
 (datetime.date(1997, 2, 1), Decimal('38483.63'), Decimal('61258.07'), Decimal('-37.18')),
 (datetime.date(1997, 3, 1), Decimal('38547.22'), Decimal('38483.63'), Decimal('0.17')),
 (datetime.date(1997, 4, 1), Decimal('53032.95'), Decimal('38547.22'), Decimal('37.58')),
 (datetime.date(1997, 5, 1), Decimal('53781.29'), Decimal('53032.95'), Decimal('1.41')),
 (datetime.date(1997, 6, 1), Decimal('36362.80'), Decimal('53781.29'), Decimal('-32.39')),
 (datetime.date(1997, 7, 1), Decimal('51020.86'), Decimal('36362.80'), Decimal('40.31')),
 (datetime.date(1997, 8, 1), Decimal('47287.67'), Decimal('51020.86'), Decimal('-7.32')),
 (datetime.date(1997, 9, 1), Decimal('55629.24'), Decimal('47287.67'), Decimal('17.64')),
 (datetime.date(1997, 10, 1), Decimal('66749.23'), Decimal('55629.24'), Decimal('19.99')),
 (datetime.date(1997, 11, 1), Decimal('43533.81'), Decimal('66749.23'), Decimal('-34.78')),
 (datetime.date(1997, 12, 1), Decimal('71398.43'), Decimal('43533.81'), Decimal('64.01')),
 (datetime.date(1998, 1, 1), Decimal('94222.11'), Decimal('71398.43'), Decimal('31.97')),
 (datetime.date(1998, 2, 1), Decimal('99415.29'), Decimal('94222.11'), Decimal('5.51')),
 (datetime.date(1998, 3, 1), Decimal('104854.16'), Decimal('99415.29'), Decimal('5.47')),
 (datetime.date(1998, 4, 1), Decimal('123798.68'), Decimal('104854.16'), Decimal('18.07')),
 (datetime.date(1998, 5, 1), Decimal('18333.63'), Decimal('123798.68'), Decimal('-85.19'))]

## Identifying high-value customers

In [56]:
%%sql
WITH customer_orders AS(
SELECT order_id, customer_id,
       ROUND(SUM(unit_price*quantity*(1-discount))::numeric,2) AS order_total,
       AVG(SUM(unit_price*quantity*(1-discount)))OVER() AS order_avg
  FROM order_product_details
 GROUP BY order_id, customer_id
),
ranked_orders AS(
SELECT *,
       CASE
           WHEN order_total > order_avg THEN 'Above average'
           WHEN order_total < order_avg THEN 'Below average'
           ELSE 'Average'
        END AS order_rank
  FROM customer_orders
)
SELECT customer_id,
       COUNT(*) AS no_of_above_average_orders
  FROM ranked_orders
 WHERE order_rank = 'Above average'
 GROUP BY customer_id
 ORDER BY no_of_above_average_orders DESC;

 * postgresql://postgres:***@localhost:5432/northwind
64 rows affected.

[('ERNSH', 26),
 ('SAVEA', 26),
 ('QUICK', 22),
 ('HUNGO', 11),
 ('RATTC', 10),
 ('BONAP', 8),
 ('FOLKO', 8),
 ('FRANK', 7),
 ('RICSU', 7),
 ('HILAA', 7),
 ('SUPRD', 6),
 ('MEREP', 6),
 ('LINOD', 6),
 ('LEHMS', 6),
 ('KOENE', 6),
 ('QUEEN', 6),
 ('SEVES', 5),
 ('HANAR', 5),
 ('BERGS', 5),
 ('VAFFE', 5),
 ('WHITC', 5),
 ('WARTH', 4),
 ('BOTTM', 4),
 ('CHOPS', 4),
 ('LILAS', 4),
 ('BLONP', 4),
 ('EASTC', 4),
 ('OLDWO', 4),
 ('PICCO', 4),
 ('VICTE', 3),
 ('GODOS', 3),
 ('FOLIG', 3),
 ('SPLIR', 3),
 ('AROUT', 3),
 ('OTTIK', 3),
 ('RICAR', 3),
 ('WANDK', 2),
 ('SIMOB', 2),
 ('LAMAI', 2),
 ('GREAL', 2),
 ('REGGC', 2),
 ('MAISD', 2),
 ('FURIB', 2),
 ('ANTON', 2),
 ('TOMSP', 1),
 ('BOLID', 1),
 ('COMMI', 1),
 ('DRACD', 1),
 ('FAMIA', 1),
 ('FRANR', 1),
 ('GOURL', 1),
 ('HUNGC', 1),
 ('ISLAT', 1),
 ('LONEP', 1),
 ('MAGAA', 1),
 ('MORGK', 1),
 ('OCEAN', 1),
 ('PRINI', 1),
 ('SANTG', 1),
 ('SPECD', 1),
 ('THEBI', 1),
 ('TORTU', 1),
 ('TRADH', 1),
 ('WELLI', 1)]

## Percentage of sales for each category

In [79]:
%%sql
WITH categories AS(
SELECT c.category_id, c.category_name,
       ROUND(SUM(od.unit_price*od.quantity*(1-od.discount))::numeric,2) AS category_sales,
       SUM(ROUND(SUM(od.unit_price*od.quantity*(1-od.discount))::numeric,2)) OVER() AS total_sales
  FROM categories AS c
  JOIN products AS p
    ON c.category_id = p.category_id
  JOIN order_details AS od
    ON p.product_id = od.product_id
 GROUP BY c.category_id, c.category_name
)
SELECT category_id, category_name, category_sales,
       ROUND((category_sales / total_sales) * 100.0::numeric,2) AS pct_of_total_sales
  FROM categories
 ORDER BY category_sales DESC;

 * postgresql://postgres:***@localhost:5432/northwind
8 rows affected.

[(1, 'Beverages', Decimal('267868.18'), Decimal('21.16')),
 (4, 'Dairy Products', Decimal('234507.28'), Decimal('18.53')),
 (3, 'Confections', Decimal('167357.23'), Decimal('13.22')),
 (6, 'Meat/Poultry', Decimal('163022.36'), Decimal('12.88')),
 (8, 'Seafood', Decimal('131261.74'), Decimal('10.37')),
 (2, 'Condiments', Decimal('106047.08'), Decimal('8.38')),
 (7, 'Produce', Decimal('99984.58'), Decimal('7.90')),
 (5, 'Grains/Cereals', Decimal('95744.59'), Decimal('7.56'))]

## Top products per category

In [84]:
%%sql
WITH sales_products AS(
SELECT c.category_name,
       p.product_id, p.product_name,
       ROUND(SUM(od.unit_price*od.quantity-(1-od.discount))::numeric,2) AS product_sales
  FROM categories AS c
  JOIN products AS p
    ON c.category_id = p.category_id
  JOIN order_details AS od
    ON p.product_id = od.product_id
 GROUP BY p.product_id, p.product_name,c.category_name
)
SELECT * 
  FROM (SELECT *,
               ROW_NUMBER() OVER(PARTITION BY category_name ORDER BY product_sales DESC) AS rank
          FROM sales_products) AS temp
  WHERE rank <=3;

 * postgresql://postgres:***@localhost:5432/northwind
24 rows affected.

[('Beverages', 38, 'Côte de Blaye', Decimal('149961.30'), 1),
 ('Beverages', 43, 'Ipoh Coffee', Decimal('25052.60'), 2),
 ('Beverages', 2, 'Chang', Decimal('18519.70'), 3),
 ('Condiments', 63, 'Vegie-spread', Decimal('17680.00'), 1),
 ('Condiments', 61, "Sirop d'érable", Decimal('16416.50'), 2),
 ('Condiments', 65, 'Louisiana Fiery Hot Pepper Sauce', Decimal('14576.55'), 3),
 ('Confections', 62, 'Tarte au sucre', Decimal('49782.50'), 1),
 ('Confections', 20, "Sir Rodney's Marmalade", Decimal('23620.54'), 2),
 ('Confections', 26, 'Gumbär Gummibärchen', Decimal('21504.55'), 3),
 ('Dairy Products', 59, 'Raclette Courdavault', Decimal('76244.55'), 1),
 ('Dairy Products', 60, 'Camembert Pierrot', Decimal('50238.26'), 2),
 ('Dairy Products', 72, 'Mozzarella di Giovanni', Decimal('25701.70'), 3),
 ('Grains/Cereals', 56, 'Gnocchi di nonna Alice', Decimal('45074.30'), 1),
 ('Grains/Cereals', 64, 'Wimmers gute Semmelknödel', Decimal('22980.23'), 2),
 ('Grains/Cereals', 42, 'Singaporean Hokkien Fried Mee', Decimal('9304.05'), 3),
 ('Meat/Poultry', 29, 'Thüringer Rostbratwurst', Decimal('87706.45'), 1),
 ('Meat/Poultry', 17, 'Alice Mutton', Decimal('35447.50'), 2),
 ('Meat/Poultry', 53, 'Perth Pasties', Decimal('21481.35'), 3),
 ('Produce', 51, 'Manjimup Dried Apples', Decimal('44705.60'), 1),
 ('Produce', 28, 'Rössle Sauerkraut', Decimal('26833.85'), 2),
 ('Produce', 7, "Uncle Bob's Organic Dried Pears", Decimal('22435.80'), 3),
 ('Seafood', 18, 'Carnarvon Tigers', Decimal('31962.65'), 1),
 ('Seafood', 10, 'Ikura', Decimal('22108.65'), 2),
 ('Seafood', 40, 'Boston Crab Meat', Decimal('19009.40'), 3)]